#include <iostream>



int main() {
    setlocale(LC_ALL, "Russian");
    std::cout << "Сижу за решеткой в темнице сырой./n"
                 "Вскормленный в неволе орел молодой,/n"
                 "Мой грустный товарищ, махая крылом,/n"
                 "Кровавую пищу клюет под окном,/n"
                 "/n"
                 "Клюет, и бросает, и смотрит в окно,/n"
                 "Как будто со мною задумал одно;/n"
                 "Зовет меня взглядом и криком своим/n"
                 "И вымолвить хочет: \"Давай улетим!/n"
                 "/n"
                 "Мы вольные птицы; пора, брат, пора!/m"
                 "Туда, где за тучей белеет гора,/n"
                 "Туда, где синеют морские края,/n"
                 "Туда, где гуляем лишь ветер... да я!..\""
    << std::endl;
    return 0;
}
